/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: etemir <marvin@42.fr>                      +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/29 13:57:35 by etemir            #+#    #+#             */
/*   Updated: 2021/10/30 12:44:22 by etemir           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */
#include<stdio.h> 
void ft_swap(int *a, int *b);
 
 int main(void)
{
 	int a;
	int b;
	a = 1;
	b = 2;
	printf("ilk değerlerim : %d, %d\n ", a, b);
	ft_swap(&a, &b);
	printf("son deger : %d, %d\n", a, b);

}
